; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v11 ?v5)
             (pred_6 ?v2 ?v4)
             (pred_1 ?v11 ?v4)
             (pred_10 ?v6 ?v11 )
	     (pred_9 ?v11)
             (pred_12 ?v12)
             (pred_2 ?v2)
             (pred_3 ?v4)
             (pred_5 ?v11)
             (pred_8 ?v2)
             (pred_4 ?v11)
             (pred_11 ))



(:action op_1
:parameters (?v1 ?v7 ?v10 ?v9)
:precondition (and (pred_12 ?v1) (pred_12 ?v7) (pred_2 ?v10) (pred_3 ?v9)
          (pred_7 ?v1 ?v7) (pred_6 ?v10 ?v9)
                   (pred_1 ?v7 ?v9) (pred_9 ?v1) 
                   (pred_5 ?v7) (pred_8 ?v10))
:effect (and  (pred_4 ?v7) (not (pred_5 ?v7))))


(:action op_4
:parameters (?v1 ?v8)
:precondition (and (pred_12 ?v1) (pred_12 ?v8)
               (pred_9 ?v1) (pred_7 ?v1 ?v8) (pred_4 ?v8))
:effect (and (pred_9 ?v8) (not (pred_9 ?v1))))

(:action op_2
:parameters (?v1 ?v10)
:precondition (and (pred_12 ?v1) (pred_2 ?v10) 
                  (pred_9 ?v1) (pred_10 ?v10 ?v1) (pred_11 ))
:effect (and (pred_8 ?v10)
   (not (pred_10 ?v10 ?v1)) (not (pred_11 ))))


(:action op_3
:parameters (?v1 ?v3 ?v13)
:precondition (and (pred_12 ?v1) (pred_2 ?v3) (pred_2 ?v13)
                  (pred_9 ?v1) (pred_8 ?v13) (pred_10 ?v3 ?v1))
:effect (and (pred_8 ?v3) (pred_10 ?v13 ?v1)
        (not (pred_8 ?v13)) (not (pred_10 ?v3 ?v1))))

(:action op_5
:parameters (?v1 ?v10)
:precondition (and (pred_12 ?v1) (pred_2 ?v10) 
                  (pred_9 ?v1) (pred_8 ?v10))
:effect (and (pred_11 ) (pred_10 ?v10 ?v1) (not (pred_8 ?v10)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_17 obj_25 obj_22 obj_04 obj_27 obj_10 obj_08 obj_18 obj_12 obj_11 obj_30 obj_15 obj_31 obj_20 obj_32 obj_02 obj_01 obj_29 obj_05 obj_09 obj_24 obj_28 obj_07 obj_06 obj_14
    obj_23 obj_19 obj_16
    obj_21 obj_26 obj_13 obj_03
    )

    (:init
       (pred_11)

       (pred_12 obj_17)
       (pred_12 obj_25)
       (pred_12 obj_22)
       (pred_12 obj_04)
       (pred_12 obj_27)
       (pred_12 obj_10)
       (pred_12 obj_08)
       (pred_12 obj_18)
       (pred_12 obj_12)
       (pred_12 obj_11)
       (pred_12 obj_30)
       (pred_12 obj_15)
       (pred_12 obj_31)
       (pred_12 obj_20)
       (pred_12 obj_32)
       (pred_12 obj_02)
       (pred_12 obj_01)
       (pred_12 obj_29)
       (pred_12 obj_05)
       (pred_12 obj_09)
       (pred_12 obj_24)
       (pred_12 obj_28)
       (pred_12 obj_07)
       (pred_12 obj_06)
       (pred_12 obj_14)
       (pred_3 obj_23)
       (pred_3 obj_19)
       (pred_3 obj_16)
       (pred_2 obj_21)
       (pred_2 obj_26)
       (pred_2 obj_13)
       (pred_2 obj_03)

       (pred_7 obj_17 obj_10)
       (pred_7 obj_17 obj_25)
       (pred_7 obj_25 obj_08)
       (pred_7 obj_25 obj_22)
       (pred_7 obj_25 obj_17)
       (pred_7 obj_22 obj_18)
       (pred_7 obj_22 obj_04)
       (pred_7 obj_22 obj_25)
       (pred_7 obj_04 obj_12)
       (pred_7 obj_04 obj_27)
       (pred_7 obj_04 obj_22)
       (pred_7 obj_27 obj_11)
       (pred_7 obj_27 obj_04)
       (pred_7 obj_10 obj_30)
       (pred_7 obj_10 obj_08)
       (pred_7 obj_10 obj_17)
       (pred_7 obj_08 obj_15)
       (pred_7 obj_08 obj_18)
       (pred_7 obj_08 obj_25)
       (pred_7 obj_08 obj_10)
       (pred_7 obj_18 obj_31)
       (pred_7 obj_18 obj_12)
       (pred_7 obj_18 obj_22)
       (pred_7 obj_18 obj_08)
       (pred_7 obj_12 obj_20)
       (pred_7 obj_12 obj_11)
       (pred_7 obj_12 obj_04)
       (pred_7 obj_12 obj_18)
       (pred_7 obj_11 obj_32)
       (pred_7 obj_11 obj_27)
       (pred_7 obj_11 obj_12)
       (pred_7 obj_30 obj_02)
       (pred_7 obj_30 obj_15)
       (pred_7 obj_30 obj_10)
       (pred_7 obj_15 obj_01)
       (pred_7 obj_15 obj_31)
       (pred_7 obj_15 obj_08)
       (pred_7 obj_15 obj_30)
       (pred_7 obj_31 obj_29)
       (pred_7 obj_31 obj_20)
       (pred_7 obj_31 obj_18)
       (pred_7 obj_31 obj_15)
       (pred_7 obj_20 obj_05)
       (pred_7 obj_20 obj_32)
       (pred_7 obj_20 obj_12)
       (pred_7 obj_20 obj_31)
       (pred_7 obj_32 obj_09)
       (pred_7 obj_32 obj_11)
       (pred_7 obj_32 obj_20)
       (pred_7 obj_02 obj_24)
       (pred_7 obj_02 obj_01)
       (pred_7 obj_02 obj_30)
       (pred_7 obj_01 obj_28)
       (pred_7 obj_01 obj_29)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_01 obj_02)
       (pred_7 obj_29 obj_07)
       (pred_7 obj_29 obj_05)
       (pred_7 obj_29 obj_31)
       (pred_7 obj_29 obj_01)
       (pred_7 obj_05 obj_06)
       (pred_7 obj_05 obj_09)
       (pred_7 obj_05 obj_20)
       (pred_7 obj_05 obj_29)
       (pred_7 obj_09 obj_14)
       (pred_7 obj_09 obj_32)
       (pred_7 obj_09 obj_05)
       (pred_7 obj_24 obj_28)
       (pred_7 obj_24 obj_02)
       (pred_7 obj_28 obj_07)
       (pred_7 obj_28 obj_01)
       (pred_7 obj_28 obj_24)
       (pred_7 obj_07 obj_06)
       (pred_7 obj_07 obj_29)
       (pred_7 obj_07 obj_28)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_06 obj_05)
       (pred_7 obj_06 obj_07)
       (pred_7 obj_14 obj_09)
       (pred_7 obj_14 obj_06)
       (pred_5 obj_31)
       (pred_5 obj_09)
       (pred_5 obj_11)
       (pred_5 obj_15)
       (pred_1  obj_31 obj_23)
       (pred_1  obj_09 obj_19)
       (pred_1  obj_11 obj_16)
       (pred_1  obj_15 obj_19)
       (pred_4 obj_17)
       (pred_4 obj_25)
       (pred_4 obj_22)
       (pred_4 obj_04)
       (pred_4 obj_27)
       (pred_4 obj_10)
       (pred_4 obj_08)
       (pred_4 obj_18)
       (pred_4 obj_12)
       (pred_4 obj_30)
       (pred_4 obj_20)
       (pred_4 obj_32)
       (pred_4 obj_02)
       (pred_4 obj_01)
       (pred_4 obj_29)
       (pred_4 obj_05)
       (pred_4 obj_24)
       (pred_4 obj_28)
       (pred_4 obj_07)
       (pred_4 obj_06)
       (pred_4 obj_14)

       (pred_6  obj_21 obj_23)
       (pred_6  obj_26 obj_19)
       (pred_6  obj_13 obj_16)
       (pred_6  obj_03 obj_16)
       (pred_10 obj_21 obj_30)
       (pred_10 obj_26 obj_22)
       (pred_10 obj_13 obj_27)
       (pred_10 obj_03 obj_07)
       (pred_9 obj_01)
    )

    (:goal (and
       (pred_10 obj_21 obj_18)
       (pred_10 obj_26 obj_27)
       (pred_10 obj_13 obj_11)
    ))
(:constraints
  (always (not (pred_9 obj_08)))
)
)

; plan
1. (op_4 obj_01 obj_29)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_29)
   goals met: 0 of 3
2. (op_4 obj_29 obj_05)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_05)
   goals met: 0 of 3
3. (op_4 obj_05 obj_20)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_20)
   goals met: 0 of 3
4. (op_4 obj_20 obj_12)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_12)
   goals met: 0 of 3
5. (op_4 obj_12 obj_18)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_18)
   goals met: 0 of 3
6. (op_4 obj_18 obj_22)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_22)
   goals met: 0 of 3
7. (op_2 obj_22 obj_26)
   deleted: (pred_10 obj_26 obj_22) (pred_11)
   added: (pred_8 obj_26)
   goals met: 0 of 3
8. (op_4 obj_22 obj_04)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_04)
   goals met: 0 of 3
9. (op_4 obj_04 obj_27)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_27)
   goals met: 0 of 3
10. (op_3 obj_27 obj_13 obj_26)
   deleted: (pred_8 obj_26) (pred_10 obj_13 obj_27)
   added: (pred_8 obj_13) (pred_10 obj_26 obj_27)
   goals met: 1 of 3
11. (op_1 obj_27 obj_11 obj_13 obj_16)
   deleted: (pred_5 obj_11)
   added: (pred_4 obj_11)
   goals met: 1 of 3
12. (op_4 obj_27 obj_11)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_11)
   goals met: 1 of 3
13. (op_5 obj_11 obj_13)
   deleted: (pred_8 obj_13)
   added: (pred_11) (pred_10 obj_13 obj_11)
   goals met: 2 of 3
14. (op_4 obj_11 obj_12)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_12)
   goals met: 2 of 3
15. (op_4 obj_12 obj_18)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_18)
   goals met: 2 of 3
16. (op_4 obj_18 obj_22)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_22)
   goals met: 2 of 3
17. (op_4 obj_22 obj_25)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_25)
   goals met: 2 of 3
18. (op_4 obj_25 obj_17)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_17)
   goals met: 2 of 3
19. (op_4 obj_17 obj_10)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_10)
   goals met: 2 of 3
20. (op_4 obj_10 obj_30)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_30)
   goals met: 2 of 3
21. (op_2 obj_30 obj_21)
   deleted: (pred_10 obj_21 obj_30) (pred_11)
   added: (pred_8 obj_21)
   goals met: 2 of 3
22. (op_4 obj_30 obj_10)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_10)
   goals met: 2 of 3
23. (op_4 obj_10 obj_17)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_17)
   goals met: 2 of 3
24. (op_4 obj_17 obj_25)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_25)
   goals met: 2 of 3
25. (op_4 obj_25 obj_22)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_22)
   goals met: 2 of 3
26. (op_4 obj_22 obj_18)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_18)
   goals met: 2 of 3
27. (op_5 obj_18 obj_21)
   deleted: (pred_8 obj_21)
   added: (pred_11) (pred_10 obj_21 obj_18)
   goals met: 3 of 3
